# Q1. List any five functions of the pandas library with execution.

In [17]:
pip install lxml

Collecting lxml
  Downloading lxml-4.9.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (7.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.1/7.1 MB 52.8 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-4.9.2
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import lxml

In [2]:
import pandas as pd

the five functions of the pandas library are :
1.read_csv()
2.read_html()
3.head()
4.tail()
5.describe()

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [7]:
df1=pd.read_html("https://www.basketball-reference.com/leagues/NBA_2015_totals.html")

In [4]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [5]:
df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
data = {
    'A': ['John', 'Jane', 'Bob', 'Alice'],
    'B': [32, 24, 45, 27],
    'C': [1,1,0,1]
    
}
df = pd.DataFrame(data)

In [9]:
df

       A   B  C
0   John  32  1
1   Jane  24  1
2    Bob  45  0
3  Alice  27  1

In [10]:
def reindex_dataframe(df):
    new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    df = df.set_index(new_index)
    return df

In [11]:
new=reindex_dataframe(df)
new

       A   B  C
1   John  32  1
3   Jane  24  1
5    Bob  45  0
7  Alice  27  1

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [19]:
data={
    'values':[10,20,30,40,50]
    }
df=pd.DataFrame(data)
def sum_of_three(df):
    sum=0
    for i in range(0,3,1):
        sum += df['values'][i]
    print(sum)
sum_of_three(df)

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [33]:
data={ 
    'Text':['Hello, how are you?', 'I am doing great!', 'Python is awesome']
     }
df= pd.DataFrame(data)
df

                  Text
0  Hello, how are you?
1    I am doing great!
2    Python is awesome

In [30]:
def add_word_count(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))

In [35]:
add_word_count(df)
df

                  Text  Word_Count
0  Hello, how are you?           4
1    I am doing great!           4
2    Python is awesome           3

# Q5. How are DataFrame.size() and DataFrame.shape() different?

 dataframe.size Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
 
 dataframe.shape Returns tuple of shape (Rows, columns) of dataframe/series

In [40]:
df.size

6

In [41]:
df.shape

(3, 2)

# Q6. Which function of pandas do we use to read an excel file?

we use pd.read_excel('filename.xlsx') function to read an excel file.

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [45]:
data={
    "email": ['abc@gmail.com','def@gmail.com','ghi@gmail.com']
    }
df=pd.DataFrame(data)
df

           email
0  abc@gmail.com
1  def@gmail.com
2  ghi@gmail.com

In [49]:
def add_col(df):
    df['Username']= df['email'].apply(lambda x: str(x).split('@')[0])

In [50]:
 add_col(df)
df

           email Username
0  abc@gmail.com      abc
1  def@gmail.com      def
2  ghi@gmail.com      ghi

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [51]:
data={
    'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C': [1,7,4,5,2]
    }
df=pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [64]:
def new_df(df):
    new=df[(df['A']>5) & (df['B']<10)]
    return new

In [66]:
a=new_df(df)
a

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [67]:
data={'Values': [10, 20, 30, 40, 50]}
df=pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [70]:
def calculate(df):
    a=df['Values'].mean()
    b=df['Values'].median()
    c=df['Values'].std()
    return a,b,c

In [71]:
mean, median, std =calculate(df)

In [72]:
mean

30.0

In [73]:
median

30.0

In [74]:
std

15.811388300841896

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [2]:
data={
    'Date': ['2023-07-01', '2023-07-02', '2023-07-03', '2023-07-04', '2023-07-05', '2023-07-06', '2023-07-07'],
                   'Sales': [10, 15, 20, 25, 30, 35, 40]
    }
df=pd.DataFrame(data)
df

         Date  Sales
0  2023-07-01     10
1  2023-07-02     15
2  2023-07-03     20
3  2023-07-04     25
4  2023-07-05     30
5  2023-07-06     35
6  2023-07-07     40

In [4]:
def new_column(df):
    df['MovingAverage']=df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [5]:
new=new_column(df)
new

         Date  Sales  MovingAverage
0  2023-07-01     10           10.0
1  2023-07-02     15           12.5
2  2023-07-03     20           15.0
3  2023-07-04     25           17.5
4  2023-07-05     30           20.0
5  2023-07-06     35           22.5
6  2023-07-07     40           25.0

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [6]:
data={
    'date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04', '2023-01-05']
    }
df=pd.DataFrame(data)
df

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [33]:
def day(df):
    df['Weekday']=df['date'].apply(lambda x:datetime.strptime(x,'%Y-%m-%d').strftime('%A') )

In [35]:
day(df)

In [36]:
df

         date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [37]:
data={
    'date':['2023-02-01','2023-01-02','2023-04-03','2023-05-04', '2023-01-05']
    }
df=pd.DataFrame(data)
df

         date
0  2023-02-01
1  2023-01-02
2  2023-04-03
3  2023-05-04
4  2023-01-05

In [39]:
def date(df):
    new=df[(df['date']>'2023-01-01')&(df['date']<'2023-01-31')]
    return new

In [40]:
new=date(df)
new

         date
1  2023-01-02
4  2023-01-05

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The first and foremost library that needs to be imported to use the basic functions of pandas is the pandas library itself.

In [ ]:
import pandas as pd